In [23]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import sqlite3

In [24]:
adult=pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data')

In [25]:
adult.columns =["age","workclass","fnlwgt","education","education_num","marital_status","occupation","relationship","race","sex","capital_gain","capital_loss","hours_per_week","native_country","income"]
adult.head(5)

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

In [26]:
#Create an sqlalchemy engine using a sample from the data set

In [27]:
import sqlalchemy
from sqlalchemy import create_engine
engine = create_engine('sqlite:///sqladb', echo=False)
adult.to_sql('sqladb', engine, if_exists='replace')

connection  = sqlite3.connect("sqladb")
cursor = connection.cursor()

In [28]:
# Write two basic update queries

In [29]:
cursor.execute('UPDATE sqladb SET fnlwgt = "11111" WHERE fnlwgt = " 83311"')
print(pd.read_sql_query("SELECT * FROM sqladb", connection).head(5))

   index  age          workclass  fnlwgt   education  education_num  \
0      0   50   Self-emp-not-inc   11111   Bachelors             13
1      1   38            Private  215646     HS-grad              9
2      2   53            Private  234721        11th              7
3      3   28            Private  338409   Bachelors             13
4      4   37            Private  284582     Masters             14

        marital_status          occupation    relationship    race      sex  \
0   Married-civ-spouse     Exec-managerial         Husband   White     Male
1             Divorced   Handlers-cleaners   Not-in-family   White     Male
2   Married-civ-spouse   Handlers-cleaners         Husband   Black     Male
3   Married-civ-spouse      Prof-specialty            Wife   Black   Female
4   Married-civ-spouse     Exec-managerial            Wife   White   Female

   capital_gain  capital_loss  hours_per_week  native_country  income
0             0             0              13   United-States   <=50K
1             0             0              40   United-States   <=50K
2             0             0              40   United-States   <=50K
3             0             0              40            Cuba   <=50K
4             0             0              40   United-States   <=50K

In [30]:
cursor.execute('UPDATE sqladb SET workclass = "Private Sector" WHERE workclass = " Private"')
print(pd.read_sql_query("SELECT * FROM sqladb", connection).head(5))

   index  age          workclass  fnlwgt   education  education_num  \
0      0   50   Self-emp-not-inc   11111   Bachelors             13
1      1   38     Private Sector  215646     HS-grad              9
2      2   53     Private Sector  234721        11th              7
3      3   28     Private Sector  338409   Bachelors             13
4      4   37     Private Sector  284582     Masters             14

        marital_status          occupation    relationship    race      sex  \
0   Married-civ-spouse     Exec-managerial         Husband   White     Male
1             Divorced   Handlers-cleaners   Not-in-family   White     Male
2   Married-civ-spouse   Handlers-cleaners         Husband   Black     Male
3   Married-civ-spouse      Prof-specialty            Wife   Black   Female
4   Married-civ-spouse     Exec-managerial            Wife   White   Female

   capital_gain  capital_loss  hours_per_week  native_country  income
0             0             0              13   United-States   <=50K
1             0             0              40   United-States   <=50K
2             0             0              40   United-States   <=50K
3             0             0              40            Cuba   <=50K
4             0             0              40   United-States   <=50K

In [31]:
#Write two delete queries

In [32]:
cursor.execute('DELETE FROM sqladb WHERE fnlwgt = " 11111"')
print(pd.read_sql_query("SELECT * FROM sqladb", connection).head(5))

   index  age       workclass  fnlwgt   education  education_num  \
0      1   38  Private Sector  215646     HS-grad              9
1      2   53  Private Sector  234721        11th              7
2      3   28  Private Sector  338409   Bachelors             13
3      4   37  Private Sector  284582     Masters             14
4      5   49  Private Sector  160187         9th              5

           marital_status          occupation    relationship    race  \
0                Divorced   Handlers-cleaners   Not-in-family   White
1      Married-civ-spouse   Handlers-cleaners         Husband   Black
2      Married-civ-spouse      Prof-specialty            Wife   Black
3      Married-civ-spouse     Exec-managerial            Wife   White
4   Married-spouse-absent       Other-service   Not-in-family   Black

       sex  capital_gain  capital_loss  hours_per_week  native_country  income
0     Male             0             0              40   United-States   <=50K
1     Male             0             0              40   United-States   <=50K
2   Female             0             0              40            Cuba   <=50K
3   Female             0             0              40   United-States   <=50K
4   Female             0             0              16         Jamaica   <=50K

In [33]:
cursor.execute('DELETE FROM sqladb WHERE age = " 38"')
print(pd.read_sql_query("SELECT * FROM sqladb", connection).head(5))

   index  age          workclass  fnlwgt   education  education_num  \
0      2   53     Private Sector  234721        11th              7
1      3   28     Private Sector  338409   Bachelors             13
2      4   37     Private Sector  284582     Masters             14
3      5   49     Private Sector  160187         9th              5
4      6   52   Self-emp-not-inc  209642     HS-grad              9

           marital_status          occupation    relationship    race  \
0      Married-civ-spouse   Handlers-cleaners         Husband   Black
1      Married-civ-spouse      Prof-specialty            Wife   Black
2      Married-civ-spouse     Exec-managerial            Wife   White
3   Married-spouse-absent       Other-service   Not-in-family   Black
4      Married-civ-spouse     Exec-managerial         Husband   White

       sex  capital_gain  capital_loss  hours_per_week  native_country  income
0     Male             0             0              40   United-States   <=50K
1   Female             0             0              40            Cuba   <=50K
2   Female             0             0              40   United-States   <=50K
3   Female             0             0              16         Jamaica   <=50K
4     Male             0             0              45   United-States    >50K

In [34]:
cursor.execute('DELETE FROM sqladb WHERE education_num = " 7"')
print(pd.read_sql_query("SELECT * FROM sqladb", connection).head(5))

   index  age          workclass  fnlwgt   education  education_num  \
0      3   28     Private Sector  338409   Bachelors             13
1      4   37     Private Sector  284582     Masters             14
2      5   49     Private Sector  160187         9th              5
3      6   52   Self-emp-not-inc  209642     HS-grad              9
4      7   31     Private Sector   45781     Masters             14

           marital_status        occupation    relationship    race      sex  \
0      Married-civ-spouse    Prof-specialty            Wife   Black   Female
1      Married-civ-spouse   Exec-managerial            Wife   White   Female
2   Married-spouse-absent     Other-service   Not-in-family   Black   Female
3      Married-civ-spouse   Exec-managerial         Husband   White     Male
4           Never-married    Prof-specialty   Not-in-family   White   Female

   capital_gain  capital_loss  hours_per_week  native_country  income
0             0             0              40            Cuba   <=50K
1             0             0              40   United-States   <=50K
2             0             0              16         Jamaica   <=50K
3             0             0              45   United-States    >50K
4         14084             0              50   United-States    >50K

In [35]:
#Write two filter queries

In [36]:
cursor.execute('SELECT DISTINCT * FROM sqladb WHERE education = " Bachelors" AND age < 25 AND relationship = " Unmarried" AND sex = " Female" and native_country=" United-States"')
output = cursor.fetchall()
print(output)

[(12965, 23, 'Private Sector', 526164, ' Bachelors', 13, ' Never-married', ' Adm-clerical', ' Unmarried', ' Black', ' Female', 0, 0, 40, ' United-States', ' <=50K'), (16657, 22, 'Private Sector', 203182, ' Bachelors', 13, ' Never-married', ' Exec-managerial', ' Unmarried', ' White', ' Female', 0, 0, 30, ' United-States', ' <=50K'), (20335, 24, 'Private Sector', 187937, ' Bachelors', 13, ' Never-married', ' Prof-specialty', ' Unmarried', ' White', ' Female', 0, 0, 40, ' United-States', ' <=50K'), (31478, 24, 'Private Sector', 498349, ' Bachelors', 13, ' Never-married', ' Transport-moving', ' Unmarried', ' Black', ' Female', 0, 0, 40, ' United-States', ' <=50K')]

In [37]:
cursor.execute('SELECT DISTINCT * FROM sqladb WHERE education = " Bachelors" and age < 25 and income <= "50k" and native_country=" India"')
output = cursor.fetchall()
print(output)

[(1094, 22, ' Self-emp-not-inc', 361280, ' Bachelors', 13, ' Never-married', ' Prof-specialty', ' Own-child', ' Asian-Pac-Islander', ' Male', 0, 0, 20, ' India', ' <=50K')]

In [38]:
#Write two function queries

In [39]:
def new_entry(db_file, new_data):
    
    query = "INSERT INTO sqladb VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?);"

    cursor.execute(query, list(new_data))
    cursor.close()
    connection.close()

new_entry('sqladb',('32660', '30','Private', '7861369', 'Masters', '9', 'Married', 'Front_End', 'In_Family', 'Indian', 'Male', '0', '0', '40', 'United-States', '>=50K'))

In [40]:
def age_check():
    connection = sqlite3.connect("sqladb")
    cursor = connection.cursor()
    cursor.execute('SELECT avg(age) FROM sqladb WHERE education=" Masters" AND sex=" Male"')
    output = cursor.fetchall()
    print(output)    
    connection.close()

age_check()

[(44.490311710193765,)]

In [41]:
connection.close()